nakagawa_6MPa/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1e-03;

vertices
(
    (0 0 1.5)     // 0-A
    (0 5 1.5)     // 1-B
    (27.35 0.12 1.5)      // 2-C
    (83.5 0.719784264 1.5)      // 3-D
    (83.5 0 1.5)      // 4-E
    (27.35 0 1.5)      // 5-F

    (0 0 -1.5)     // 6-A'
    (0 5 -1.5)     // 7-B'
    (27.35 0.12 -1.5)      // 8-C'
    (83.5 0.719784264 -1.5)      // 9-D'
    (83.5 0 -1.5)      // 10-E'
    (27.35 0 -1.5)      // 11-F'
);

blocks
(
    hex (0 1 2 5 6 7 8 11)      // ABCFA'B'C'F'
    (60 70 10)
    simpleGrading (1.0 1.0 1.0)

    hex (5 2 3 4 11 8 9 10)     // FCDEF'C'D'E'
    (60 130 10)
    simpleGrading (1.0 1.0 1.0)
);

boundary
(
    axis
    {
        type symmetry;
        faces
        (
            (0 5 11 6)
            (5 4 10 11)
        );
    }

    inlet
    {
        type patch;
        faces
        (
            (0 1 7 6)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (4 3 9 10)
        );
    }

    wall
    {
        type wall;
        faces
        (
            (1 2 8 7)
            (2 3 9 8)
        );
    }

    front
    {
        type wall;
        faces
        (
            (0 1 2 5)
            (5 2 3 4)
        );
    }

    back
    {
        type wall;
        faces
        (
            (6 7 8 11)
            (11 8 9 10)
        );
    }
);


// ************************************************************************* //
