nakagawa_6MPa/system/fvConstraints
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvConstraints;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

limitp
{
    type        limitPressure;
    min         517965;
    max         1e7;
}
limitT
{
    type        limitTemperature;
    select      all;
    phase       liquid;
    min         218.6;
    max         399.9;
}
limitT
{
    type        limitTemperature;
    select      all;
    phase       gas;
    min         218.6;
    max         399.9;
}
// ************************************************************************* //